13/data/attachments/524cbae827b7c028.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a60f3bfe-14c3-416c-bec0-18aa7960c8ea</nif:username>
            <nif:friendToBeAdded>Donald_paper_Friend_28196_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>